//
//  StoreBooksInfo.swift
//  MagicPaper
//
//  Created by Arden  on 28.05.2020.
//  Copyright © 2020 Arden Zhakhin. All rights reserved.
//

import Foundation
import UIKit

class StoreBooksInfo {
    
    let storeBookTitle1: String = "Физика 8 класс"
    let storeBookDescription1: String = "Автор: Перышкин А.В. М.: Дрофа, 2013."
    let storeBookDetail1: String = "Учебник доработан в соответствии с требованиями Федерального государственного образовательного стандарта, рекомендован Министерством образования и науки РФ и включен в Федеральный перечень учебников. Большое количество красочных иллюстраций, разнообразные вопросы и задания, а также дополнительные сведения и любопытные факты способствуют эффективному усвоению учебного материала."
    let storeBookImageName1: String = "Физика 8 класс Перышкин"
    
    
    let storeBookTitle2: String = "История России 10 класс"
    let storeBookDescription2: String = "Автор: Борисов Н.С. М.: Просвещение, 2010, 5-е издание."
    let storeBookDetail2: String = "Учебник позволяет получить прочные знания о событиях и фактах отечественной истории с древнейших времен до конца 17 века. Наряду с этим дается глубокое теоретическое осмысление исторического материала. Рекомендовано Министерством образования и науки Российской Федерации. 5-е издание."
    let storeBookImageName2: String = "История России 10 класс Борисов"
    
    
    let storeBookTitle3: String = "Nuevo espanol en marcha"
    let storeBookDescription3: String = "Учебник по испанскому"
    let storeBookDetail3: String = "Nuevo Espanol en marcha es un curso de espanol para jovenes у adultos que abarca los contenidos correspondientes a los niveles A1, A2, B1 у B2 del Marco comun europeo de reference."
    let storeBookImageName3: String = "Nuevo espanol en marcha"
    
    
    let storeBookTitle4: String = "Биология 8 класс"
    let storeBookDescription4: String = "Автор: Колесов Д.В. М.: Дрофа, 2019, 7-е издание"
    let storeBookDetail4: String = "Предлагаемый учебник входит в учебно-методический комплекс по биологии для 8 класса и рассчитан на преподавание биологии 2 часа в неделю. Все учебники линии для основной школы (5-9 классы) созданы под руководством В. В. Пасечника, соответствуют Федеральному государственному образовательному стандарту основного общего образования и включены в Федеральный перечень учебников. Большое количество красочных иллюстраций, разнообразные вопросы и за­дания, лабораторные работы, дополнительные сведения и любопытные факты, а также возможность работы с электронным приложением способствуют эффективному усвоению учебного материала. Рекомендовано Министерством образования и науки Российской Федерации. 7-е издание, исправленное."
    let storeBookImageName4: String = "Биология 8 класс Колесов"

    
    let storeBookTitle5: String = "Анатомия человека. Тело. Как это работает."
    let storeBookDescription5: String = ""
    let storeBookDetail5: String = "Книга под общей редакцией признанного профессора анатомии, известного преподавателя, автора пособий и учебников Питера Абрахамса посвящена строению и функционированию тела человека. На основе самых современных медицинских знаний изложены основы анатомии, физиологической деятельности человека. Великолепно иллюстрированное издание удобно в использовании: материал разбит на разделы по анатомическим структурам, начиная с черепа и заканчивая костями стопы. Дано общее представление о костях, мышцах, нервах, мягких тканях и органах, показано их взаимодействие друг с другом. Цветные фотографии добавляют наглядности. Книга предназначена для широкого круга читателей, также будет полезна студентам медицинских вузов и колледжей, и профессионалам, работающим в медицинской отрасли."
    let storeBookImageName5: String = "Анатомия человека"

    
    let storeBookTitle6: String = "Журнал «Esquire»"
    let storeBookDescription6: String = "Май 2020"
    let storeBookDetail6: String = "Выпуск мужского журнала Esquire №5 май 2020. Читайте в этом номере: философ Александр Нечаев рассуждает, как получилось, что миропорядок пришел в беспорядок; «Сталингулаг» о том, как гаджеты отвлекают нас от решения проблем; премьера фильма «Брат 2» была 20 лет назад; Михаил Козырев рассказывает, как подбирал саундтреки для фильма «Брат 2»; как создавался «Брат 2» и почему Алексей Балабанов впервые решил снять сиквел; наследие: как «Брат 2» на нас и нашу культуру; правила жизни актера Тома Хэнкса; правила жизни рэпера Джей-Зи; Beastie Boys: история трех евреев из Бруклина."
    let storeBookImageName6: String = "Esquire май 2020"

    
    let storeBookTitle7: String = "Известия СПбГЭТУ «ЛЭТИ»"
    let storeBookDescription7: String = "№ 10 / 2019"
    let storeBookDetail7: String = "Журнал «Известия СПбГЭТУ «ЛЭТИ» публикует результаты исследований работников, докторантов, аспирантов и студентов в областях физики, электротехники, приборостроения, информационных и компьютерных технологий, автоматизации и управления, химии и в смежных областях."
    let storeBookImageName7: String = "Известия ЛЭТИ"

    
    let storeBookTitle8: String = "Учебное пособие. Компьютерная 3D-графика"
    let storeBookDescription8: String = "Автор: Герасимова Т. В."
    let storeBookDetail8: String = "Содержит сведения о средствах разработки программного обеспечения для визуализации реалистичных изображений сложных трехмерных сцен, а также об их использовании при выполнении лабораторных и практических работ по курсам «Компьютерная графика» и «Компьютерная 3D-графика». Предназначено для студентов направлений 09.03.04 «Программная инженерия» и 01.03.02 «Прикладная математика и информатика», а также для подготовки магистров по направлению 09.04.04 «Программная инженерия» по программе «Разработка распределенных программных систем» и может быть полезно инженерно-техническим работникам этой области знаний."
    let storeBookImageName8: String = "Компьютерная графика"
    
    
    let storeBookTitle9: String = "Daily Prophet"
    let storeBookDescription9: String = ""
    let storeBookDetail9: String = "The wizard world's beguiling broadsheet to choice!"
    let storeBookImageName9: String = "Daily Prophet"
    
}
